{
  "1": "Why do programmers prefer dark mode? Because light attracts bugs.",
  "2": "There are 10 kinds of people in the world: those who understand binary and those who don’t.",
  "3": "I told my computer I needed a break… now it won’t stop sending me KitKat ads.",
  "4": "Debugging: being the detective in a crime movie where you are also the murderer.",
  "5": "A SQL query walks into a bar, walks up to two tables and asks, ‘Can I join you?’",
  "6": "Why do Java developers wear glasses? Because they can’t C#.",
  "7": "In Python, ‘import this’ and you’ll get some life advice.",
  "8": "I asked the Python function for help. It said, ‘I can’t, I’m not callable right now.’",
  "9": "To understand recursion you must first understand recursion.",
  "10": "Programmer (on date): 'I have commitment issues.' Date: 'Why?' Programmer: 'Well, my code runs fine on my machine.'",
  "11": "A programmer’s wife says, ‘While you’re at the store, buy eggs.’ He never comes back.",
  "12": "Segmentation fault: the core of every relationship problem.",
  "13": "Why did the developer go broke? Because he used up all his cache.",
  "14": "Python: Come for the whitespace, stay because indentation errors won’t let you leave.",
  "15": "Real programmers count from 0.",
  "16": "Knock knock. Who’s there? *very long pause…* Java.",
  "17": "Copy programmers don’t respect copyrights; they just see right.",
  "18": "A C function walks into a bar and asks for a malloc on the rocks.",
  "19": "The best thing about a Boolean is even if you’re wrong, you’re only off by a bit.",
  "20": "‘I use Vim!’ ‘I use Emacs!’ ‘I use Nano…’ – an infinite loop of editors.",
  "21": "Why did the Python dev stay calm? Because he had ‘try’ blocks.",
  "22": "How many programmers does it take to change a light bulb? None, that’s a hardware problem.",
  "23": "Git commit message: ‘Fixed the thing.’ Future me: ‘What thing?!’",
  "24": "Java is to JavaScript what car is to carpet.",
  "25": "Why was the function sad? It didn’t get any arguments.",
  "26": "Fibonacci programmers: 1, 1, 2, 3, 5, 8, lunchtime.",
  "27": "99 little bugs in the code, 99 bugs in the code, take one down, patch it around, 127 bugs in the code.",
  "28": "Python dev: ‘I only date models.’ *imports sklearn*",
  "29": "Doctor: ‘You’ve got a heap overflow.’ Programmer: ‘Is it fatal?’ Doctor: ‘No, it’s just a stack overflow joke.’",
  "30": "A programmer’s diet: lots of coffee, no cookies unless they’re HTTP-only.",
  "31": "Why do Python programmers need glasses? Because they don’t C.",
  "32": "IDEs are great… until they start to autocomplete your life choices.",
  "33": "Object-oriented programmers hate autumn—they don’t like to fall back into procedural habits.",
  "34": "‘Works on my machine’ is QA’s version of ‘It depends.’",
  "35": "I have a joke on memory leaks, but I keep forgetting it.",
  "36": "Python 2 or Python 3? That is the print() statement.",
  "37": "Why was the developer always calm? Because he used async/await to handle his emotions.",
  "38": "Q: What’s a programmer’s favorite hangout place? A: The Foo Bar.",
  "39": "Programmer pickup line: ‘Are you an exception? Because I’d like to handle you.’",
  "40": "Life would be easier if we had a Ctrl+Z button.",
  "41": "Why did the Python list break up with the string? Too many splits.",
  "42": "If at first you don’t succeed; call it version 1.0.",
  "43": "Parallel programmers do it simultaneously.",
  "44": "Why did the integer drown? It couldn’t Float.",
  "45": "0 is false and 1 is true, but 2 is too much information.",
  "46": "Regex: now you have two problems.",
  "47": "I wrote a joke in Assembly once… but no one could decode it.",
  "48": "A pointer and an int walk into a bar. The bartender asks, ‘So, where’s the array?’",
  "49": "Why did the Python data scientist go hungry? The food was in a NumPy array and he couldn’t find the scalar.",
  "50": "Premature optimization is the root of all evil – but so is no optimization."
}